Revit 2027 API
ControlledApplication.VersionBuild Property
 Returns the internal build number of the Autodesk Revit application.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string VersionBuild { get; }
Public ReadOnly Property VersionBuild As String
	Get
public:
property String^ VersionBuild {
	String^ get ();
}
member VersionBuild : string with get
Property Value
String
Remarks
 This property can be used by your application to find the version of Autodesk Revit against which your application is running. Based on this information your application can report if it is able to work correctly with that version of Autodesk Revit.
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace